<template>
  <div>
    <section class="section">
      <!-- 插图 -->
      <svg
        class="img"
        id="undraw_environmental_study_skau"
        xmlns="http://www.w3.org/2000/svg"
        width="335.598"
        height="229.818"
        viewBox="0 0 335.598 229.818"
      >
        <path
          id="路径_630"
          data-name="路径 630"
          d="M948.43,629.271a5.95,5.95,0,0,0-4.134,1.983c-3.523-12.7-8.978-20.858-15.106-20.858s-11.583,8.16-15.106,20.858a5.95,5.95,0,0,0-4.134-1.983c-6.962,0-12.606,16.055-12.606,35.861h63.692C961.036,645.326,955.392,629.271,948.43,629.271Z"
          transform="translate(-630.908 -442.279)"
          fill="#d0cde1"
        />
        <path
          id="路径_631"
          data-name="路径 631"
          d="M380.43,578.238a7.011,7.011,0,0,0-4.134,1.455c-3.523-9.312-8.978-15.3-15.106-15.3s-11.583,5.984-15.106,15.3a7.011,7.011,0,0,0-4.134-1.455c-6.962,0-12.606,11.774-12.606,26.3h63.692C393.035,590.012,387.392,578.238,380.43,578.238Z"
          transform="translate(-251.329 -411.539)"
          fill="#d0cde1"
        />
        <path
          id="路径_632"
          data-name="路径 632"
          d="M430.892,697.158H95.854c.3-27.222,75.189-49.262,167.519-49.262S430.59,669.936,430.892,697.158Z"
          transform="translate(-95.294 -467.34)"
          fill="#3f3d56"
        />
        <circle
          id="椭圆_117"
          data-name="椭圆 117"
          cx="42.852"
          cy="42.852"
          r="42.852"
          transform="translate(0 37.085)"
          fill="#d0cde1"
        />
        <path
          id="路径_633"
          data-name="路径 633"
          d="M222.638,457.508h-2.419V339.815a40.51,40.51,0,0,1,1.21-9.825h0a40.51,40.51,0,0,1,1.21,9.825Z"
          transform="translate(-178.404 -254.891)"
          fill="#3f3d56"
        />
        <path
          id="路径_634"
          data-name="路径 634"
          d="M221.707,425.644l-1.274-2.056,17.9-11.091a7.621,7.621,0,0,1,4.139-1.142h0a7.621,7.621,0,0,1-2.865,3.2Z"
          transform="translate(-178.547 -309.264)"
          fill="#3f3d56"
        />
        <path
          id="路径_635"
          data-name="路径 635"
          d="M192.89,399.833l1.274-2.056-12.317-7.633a4.583,4.583,0,0,0-3.274-.606h0a4.583,4.583,0,0,0,2,2.662Z"
          transform="translate(-150.573 -294.632)"
          fill="#3f3d56"
        />
        <path
          id="路径_636"
          data-name="路径 636"
          d="M192.89,541.512l1.274-2.056-12.317-7.633a4.583,4.583,0,0,0-3.274-.606h0a4.584,4.584,0,0,0,2,2.662Z"
          transform="translate(-150.573 -389.311)"
          fill="#3f3d56"
        />
        <circle
          id="椭圆_118"
          data-name="椭圆 118"
          cx="41.134"
          cy="41.134"
          r="41.134"
          transform="translate(228.951 39.407)"
          fill="#d0cde1"
        />
        <path
          id="路径_637"
          data-name="路径 637"
          d="M904.344,454.8h2.322V341.828A38.883,38.883,0,0,0,905.5,332.4h0a38.886,38.886,0,0,0-1.161,9.431Z"
          transform="translate(-635.586 -256.5)"
          fill="#3f3d56"
        />
        <path
          id="路径_638"
          data-name="路径 638"
          d="M867.3,424.217l1.223-1.974L851.34,411.6a7.315,7.315,0,0,0-3.973-1.1h0a7.316,7.316,0,0,0,2.75,3.07Z"
          transform="translate(-597.51 -308.694)"
          fill="#3f3d56"
        />
        <path
          id="路径_639"
          data-name="路径 639"
          d="M907.427,399.441l-1.223-1.974,11.824-7.327a4.4,4.4,0,0,1,3.143-.582h0a4.4,4.4,0,0,1-1.92,2.556Z"
          transform="translate(-636.828 -294.647)"
          fill="#3f3d56"
        />
        <path
          id="路径_640"
          data-name="路径 640"
          d="M907.427,535.441l-1.223-1.974,11.824-7.327a4.4,4.4,0,0,1,3.143-.582h0a4.4,4.4,0,0,1-1.92,2.555Z"
          transform="translate(-636.828 -385.532)"
          fill="#3f3d56"
        />
        <path
          id="路径_641"
          data-name="路径 641"
          d="M215.647,779.57a2.676,2.676,0,0,0-1.077.228,4.423,4.423,0,0,0-7.868,0,2.676,2.676,0,0,0-1.077-.228c-1.813,0-3.283,1.849-3.283,4.129H218.93C218.93,781.419,217.46,779.57,215.647,779.57Z"
          transform="translate(-166.458 -553.881)"
          fill="#d0cde1"
        />
        <path
          id="路径_642"
          data-name="路径 642"
          d="M525.647,768.057a1.808,1.808,0,0,0-1.077.385c-.918-2.463-2.338-4.045-3.934-4.045s-3.016,1.583-3.934,4.045a1.808,1.808,0,0,0-1.077-.385c-1.813,0-3.283,3.114-3.283,6.955H528.93C528.93,771.171,527.46,768.057,525.647,768.057Z"
          transform="translate(-373.623 -545.193)"
          fill="#d0cde1"
        />
        <path
          id="路径_643"
          data-name="路径 643"
          d="M956.647,768.057a1.808,1.808,0,0,0-1.077.385c-.918-2.463-2.338-4.045-3.934-4.045s-3.016,1.583-3.934,4.045a1.809,1.809,0,0,0-1.077-.385c-1.813,0-3.283,3.114-3.283,6.955H959.93C959.93,771.171,958.46,768.057,956.647,768.057Z"
          transform="translate(-661.648 -545.193)"
          fill="#222a36"
        />
        <path
          id="路径_644"
          data-name="路径 644"
          d="M614.728,482.069l-.527,2.5-.659,2.5-2.107,29.771,7.245.527,3.293-32.538-.527-1.712Z"
          transform="translate(-408.605 -322.154)"
          fill="#2f2e41"
        />
        <path
          id="路径_645"
          data-name="路径 645"
          d="M681.57,678.2l-3.03,4.611s-8.431,6.85-2.371,7.245a8.5,8.5,0,0,0,8.3-4.084s2.108-.659,2.371-1.317-.527-6.455-.527-6.455Z"
          transform="translate(-481.639 -487.59)"
          fill="#2f2e41"
        />
        <path
          id="路径_646"
          data-name="路径 646"
          d="M701.81,688.92s-3.03,7.64-2.635,8.958,1.054,1.317.922,2.5-.527,3.952,4.479,4.084,2.635-6.587,2.635-6.587l-.659-8.958Z"
          transform="translate(-498.454 -494.755)"
          fill="#2f2e41"
        />
        <path
          id="路径_647"
          data-name="路径 647"
          d="M676.156,516.807s-1.844,3.162-1.581,5.138,4.084,23.185,4.084,23.185l3.03,25.819,6.718-.527-2.635-23.843.659-18.969,1.186,13.964,7.772.263L700,521.945s-3.425-5.533-4.084-5.928S676.156,516.807,676.156,516.807Z"
          transform="translate(-482.02 -379.154)"
          fill="#2f2e41"
        />
        <circle
          id="椭圆_119"
          data-name="椭圆 119"
          cx="5.664"
          cy="5.664"
          r="5.664"
          transform="translate(197.626 86.344)"
          fill="#ffb8b8"
        />
        <path
          id="路径_648"
          data-name="路径 648"
          d="M607.861,282.974l.79,7.509,8.694-1.317-4.742-8.826Z"
          transform="translate(-406.217 -187.343)"
          fill="#ffb8b8"
        />
        <path
          id="路径_649"
          data-name="路径 649"
          d="M697.584,403.8s-4.479,3.293-8.826,1.449l-6.587,16.73v20.945s9.88,2.9,15.413-.527a32.053,32.053,0,0,1,4.611-.659c.659.132-2.371-35.7-2.371-35.7Z"
          transform="translate(-487.114 -304.215)"
          fill="#d0cde1"
        />
        <path
          id="路径_650"
          data-name="路径 650"
          d="M716.323,400.7l3.03,4.347a5.244,5.244,0,0,1,.527,3.557c-.4,2.108-.79,29.639,2.9,30.693a20.285,20.285,0,0,0,6.06.922s-3.293-15.808-2.108-18.574l3.689-16.6-9.748-5.533s-.61-2.5-1.622-1.12a9.364,9.364,0,0,1-2.725,2.305Z"
          transform="translate(-509.936 -300.324)"
          fill="#575a89"
        />
        <path
          id="路径_651"
          data-name="路径 651"
          d="M666.629,429.09l4.5-25.292-4.5,2.371s-5.137,2.108-6.191,4.611-5.269,14.49-5.269,14.49,1.054,7.245,5.006,4.215,3.03-4.479,3.03-4.479-3.425,13.963-2.9,14.359.79,4.084.79,4.084l4.084-.79Z"
          transform="translate(-469.069 -304.215)"
          fill="#575a89"
        />
        <path
          id="路径_652"
          data-name="路径 652"
          d="M674.23,421.062l1.712-2.5s3.873-7.772,6.679-5.137-5.23,8.694-5.23,8.694Z"
          transform="translate(-481.807 -310.282)"
          fill="#ffb8b8"
        />
        <path
          id="路径_653"
          data-name="路径 653"
          d="M647.831,416.15l-1.054,1.352,2.635,3.39,1.186-2.371Z"
          transform="translate(-432.223 -278.102)"
          fill="#ffb8b8"
        />
        <path
          id="路径_654"
          data-name="路径 654"
          d="M690.37,358.86a2.953,2.953,0,0,0-1.567.7,2.457,2.457,0,0,1-1.6.6,1.72,1.72,0,0,1-1.251-.955,5.081,5.081,0,0,1-.439-1.57l.657.232-.532-.605,5.659-1.719c1.712-.52,3.647-1.021,5.216-.16a5.14,5.14,0,0,1,1.895,2.065,10.767,10.767,0,0,1-.15,10.6,2.038,2.038,0,0,1-1.574-1.842c-.141-.86,0-1.75-.177-2.6s-.825-1.728-1.7-1.7l-.458.977c.293-.625-1.449-2.153-1.864-2.437a5.663,5.663,0,0,1-1.015-.74C691.116,359.319,691.026,358.853,690.37,358.86Z"
          transform="translate(-489.35 -271.544)"
          fill="#2f2e41"
        />
        <path
          id="路径_655"
          data-name="路径 655"
          d="M661.5,433.184l3.162,1.976L661.5,448.333s-5.006,6.191-6.85,0c-1.544-5.182,4.3-12.3,6.241-14.486C661.27,433.422,661.5,433.184,661.5,433.184Z"
          transform="translate(-468.551 -323.853)"
          fill="#575a89"
        />
        <path
          id="路径_656"
          data-name="路径 656"
          d="M743.841,418.491h3.03s2.635,5.138,2.9,7.9.263,13.7.263,13.7L744.9,455.376l-3.952-2.9,3.293-9.089a6.765,6.765,0,0,1,0-2.9c.4-.922-1.186-5.664-1.449-5.928S743.841,418.491,743.841,418.491Z"
          transform="translate(-526.39 -314.034)"
          fill="#575a89"
        />
        <rect
          id="矩形_1763"
          data-name="矩形 1763"
          width="35.646"
          height="3.176"
          transform="translate(181.52 43.218) rotate(180)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1764"
          data-name="矩形 1764"
          width="35.646"
          height="3.176"
          transform="translate(181.52 54.919) rotate(180)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1765"
          data-name="矩形 1765"
          width="35.646"
          height="3.176"
          transform="translate(181.52 65.401) rotate(180)"
          fill="#3f3d56"
        />
        <path
          id="路径_657"
          data-name="路径 657"
          d="M264.335,180.51,281.819,162.7h19.765v-.663H281.542l-.1.1-17.582,17.913Z"
          transform="translate(-176.332 -108.282)"
          fill="#3f3d56"
        />
        <circle
          id="椭圆_120"
          data-name="椭圆 120"
          cx="3.9"
          cy="3.9"
          r="3.9"
          transform="translate(130.759 38.704)"
          fill="#222a36"
        />
        <circle
          id="椭圆_121"
          data-name="椭圆 121"
          cx="3.9"
          cy="3.9"
          r="3.9"
          transform="translate(130.759 50.405)"
          fill="#222a36"
        />
        <circle
          id="椭圆_122"
          data-name="椭圆 122"
          cx="3.9"
          cy="3.9"
          r="3.9"
          transform="translate(130.759 60.888)"
          fill="#222a36"
        />
        <path
          id="路径_658"
          data-name="路径 658"
          d="M493.488,220.748a4.144,4.144,0,1,1,4.144,4.144A4.144,4.144,0,0,1,493.488,220.748Zm.488,0a3.657,3.657,0,1,0,3.657-3.657A3.657,3.657,0,0,0,493.975,220.748Z"
          transform="translate(-361.022 -179.118)"
          fill="#3f3d56"
        />
        <path
          id="路径_659"
          data-name="路径 659"
          d="M493.488,256.022a4.144,4.144,0,1,1,4.144,4.144A4.144,4.144,0,0,1,493.488,256.022Zm.488,0a3.657,3.657,0,1,0,3.657-3.657A3.657,3.657,0,0,0,493.975,256.022Z"
          transform="translate(-361.022 -202.691)"
          fill="#3f3d56"
        />
        <path
          id="路径_660"
          data-name="路径 660"
          d="M493.488,287.621a4.144,4.144,0,1,1,4.144,4.144A4.144,4.144,0,0,1,493.488,287.621Zm.488,0a3.657,3.657,0,1,0,3.657-3.657A3.657,3.657,0,0,0,493.975,287.621Z"
          transform="translate(-361.022 -223.808)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1766"
          data-name="矩形 1766"
          width="35.646"
          height="3.176"
          transform="translate(177.9 2.556)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1767"
          data-name="矩形 1767"
          width="35.646"
          height="3.176"
          transform="translate(177.9 14.257)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1768"
          data-name="矩形 1768"
          width="35.646"
          height="3.176"
          transform="translate(177.9 24.74)"
          fill="#3f3d56"
        />
        <path
          id="路径_661"
          data-name="路径 661"
          d="M739.837,70.827,725.67,49.7H705.905v-.663h20.042l.1.1,14.264,21.231Z"
          transform="translate(-471.737 -32.767)"
          fill="#3f3d56"
        />
        <circle
          id="椭圆_123"
          data-name="椭圆 123"
          cx="3.9"
          cy="3.9"
          r="3.9"
          transform="translate(220.859 1.219)"
          fill="#222a36"
        />
        <circle
          id="椭圆_124"
          data-name="椭圆 124"
          cx="3.9"
          cy="3.9"
          r="3.9"
          transform="translate(220.859 12.92)"
          fill="#222a36"
        />
        <circle
          id="椭圆_125"
          data-name="椭圆 125"
          cx="3.9"
          cy="3.9"
          r="3.9"
          transform="translate(220.859 23.403)"
          fill="#222a36"
        />
        <path
          id="路径_662"
          data-name="路径 662"
          d="M757.482,111.892a4.144,4.144,0,1,1,4.144-4.144,4.144,4.144,0,0,1-4.144,4.144Zm0-7.8a3.657,3.657,0,1,0,3.657,3.657A3.657,3.657,0,0,0,757.482,104.091Z"
          transform="translate(-534.673 -103.603)"
          fill="#3f3d56"
        />
        <path
          id="路径_663"
          data-name="路径 663"
          d="M757.482,147.166a4.144,4.144,0,1,1,4.144-4.144A4.144,4.144,0,0,1,757.482,147.166Zm0-7.8a3.657,3.657,0,1,0,3.657,3.657A3.657,3.657,0,0,0,757.482,139.365Z"
          transform="translate(-534.673 -127.176)"
          fill="#3f3d56"
        />
        <path
          id="路径_664"
          data-name="路径 664"
          d="M757.482,178.765a4.144,4.144,0,1,1,4.144-4.144A4.144,4.144,0,0,1,757.482,178.765Zm0-7.8a3.657,3.657,0,1,0,3.657,3.657A3.657,3.657,0,0,0,757.482,170.964Z"
          transform="translate(-534.673 -148.293)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1769"
          data-name="矩形 1769"
          width="24.896"
          height="2.218"
          transform="translate(175.64 127.337) rotate(180)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1770"
          data-name="矩形 1770"
          width="24.896"
          height="2.218"
          transform="translate(175.64 135.51) rotate(180)"
          fill="#3f3d56"
        />
        <rect
          id="矩形_1771"
          data-name="矩形 1771"
          width="24.896"
          height="2.218"
          transform="translate(175.64 142.831) rotate(180)"
          fill="#3f3d56"
        />
        <path
          id="路径_665"
          data-name="路径 665"
          d="M331.916,418.944,344.128,406.5h13.8v-.463h-14l-.068.069-12.279,12.511Z"
          transform="translate(-221.591 -271.344)"
          fill="#3f3d56"
        />
        <circle
          id="椭圆_126"
          data-name="椭圆 126"
          cx="2.724"
          cy="2.724"
          r="2.724"
          transform="translate(140.188 124.185)"
          fill="#222a36"
        />
        <circle
          id="椭圆_127"
          data-name="椭圆 127"
          cx="2.724"
          cy="2.724"
          r="2.724"
          transform="translate(140.188 132.358)"
          fill="#222a36"
        />
        <circle
          id="椭圆_128"
          data-name="椭圆 128"
          cx="2.724"
          cy="2.724"
          r="2.724"
          transform="translate(140.188 139.679)"
          fill="#222a36"
        />
        <path
          id="路径_666"
          data-name="路径 666"
          d="M520.36,478.291a2.894,2.894,0,1,1,2.894,2.894A2.894,2.894,0,0,1,520.36,478.291Zm.341,0a2.554,2.554,0,1,0,2.554-2.554,2.554,2.554,0,0,0-2.554,2.554Z"
          transform="translate(-378.98 -352.063)"
          fill="#3f3d56"
        />
        <path
          id="路径_667"
          data-name="路径 667"
          d="M520.36,502.927a2.894,2.894,0,1,1,2.894,2.894A2.894,2.894,0,0,1,520.36,502.927Zm.341,0a2.554,2.554,0,1,0,2.554-2.554A2.554,2.554,0,0,0,520.7,502.927Z"
          transform="translate(-378.98 -368.526)"
          fill="#3f3d56"
        />
        <path
          id="路径_668"
          data-name="路径 668"
          d="M520.36,525a2.894,2.894,0,1,1,2.894,2.894A2.894,2.894,0,0,1,520.36,525Zm.341,0a2.554,2.554,0,1,0,2.554-2.554A2.554,2.554,0,0,0,520.7,525Z"
          transform="translate(-378.98 -383.275)"
          fill="#3f3d56"
        />
      </svg>

      <!-- 新手卡片 -->
      <div class="card">
        <div class="item item-1">
          <span>🤔 什么是「每日计划」与「临时计划」？</span>
        </div>

        <div class="item item-2">
          <div>
            要想<span>「成为健身达人」</span>，就要计划<span
              >「健身一小时」</span
            ><br />
            然后每天执行它———这就是<span>「每日计划」</span>
          </div>
        </div>

        <div class="item item-3">
          <div>
            而生活中那些<span>「临时事件」</span>，比如<span
              >「帮妈妈买菜」</span
            ><br />
            我们可以用<span>「临时计划」</span>记录它
          </div>
        </div>
      </div>
    </section>
  </div>
</template>

<script lang="ts">
import { defineComponent } from "@vue/composition-api";
export default defineComponent({});
</script>

<style lang="stylus" scoped>
.section {
  width 100%
  display flex
  flex-direction column
  align-items center
}

.img {
  width 44.75vw
  height 17.23vh
}

.card {
  display flex
  flex-direction column
  box-shadow 0 0.22vh 0.44vh rgba(0, 0, 0, 0.16)
  width 96.53vw
  height 28.11vh
  margin-top 2.85vh
}

.item {
  display flex
  align-items center
  justify-content center
  color white
  font-weight normal
  font-size 2.02vh
  text-align center

  span {
    font-weight bold
  }
}

.item-1 {
  width 96.53vw
  height 6.67vh
  background #5A5B9F
  border-radius 1.42vh 1.42vh 0 0
}

.item-2 {
  width 96.53vw
  height 10.79vh
  background #222A36
}

.item-3 {
  width 96.53vw
  height 10.79vh
  background #F9385E
  border-radius 0 0 1.42vh 1.42vh
}
</style>
